export const strings = {
  Common: {
    submit: 'Submit',    
    showMore:'مشاهده همه',
    suggestion:'پیشنهادهای اسرارآمیز',
    currency:'تومان',
    nameStore:'آلین لند شاپس'
    
  },
  headerSection:{
    login:'ورود به حساب کاربری ',
    serach:'جستجو  ...',
    byFrom:'خرید از',
    shopName:' فروشگاه زنجیره ای وال مارکت',    
  },
  navbar:{
    category:'دسته بندی  محصولات',
    anotherShoping:'سایر فروشگاه ها',
    time:'۳۰ دقیقه',
    location:'ارسال به بزرگراه یادگار امام، خیابان آبشار، کوچه چهاردیوار ...'
  },
  mainCategoryPage:{
    bestOffer:'پیشنهادهای اسرارآمیز',
    milks:'لبنیات',
    drinks:'نوشیدنی',
    breakFast:'صبحانه',
    snacks:'تنقلات',
    protein:'مواد پروتئینی',
    vegetables:'میوه و سبزیجات تازه',
    mainProduct:'کالای اساسی و خواربار',
    rangePriceSubmit:'اعمال محدوده قیمت',
    products:{
      sos:'سس گوجه فرنگی بیژن وزن 550 گرم',
      milk:'شیر نیم چرب ارگانیک کوهپناه مقدار 940 میلی لیتر',
      dogh:'دوغ با طعم نعنا هراز - 1.5 لیتر',
      brnj:'برنج طارم هاشمی ممتاز طبیعت - 10 کیلوگرم',
      zeyton:'زیتون شور بی هسته بیژن وزن 630 گرم',
    },
  },
  footer:{
    delivery:'ارسال سریع',
    refund:'ضمانت 7 روزه بازگشت کالا',
    suport:'پشتیبانی 24 ساعته',
    safePayment:'پرداخت امن',
    title:'فروشگاه اینترنتی آلین شاپس',
    describeAbputUs:'در آلین شاپس این امکان وجود دارد که تمام محصولات موجود در فروشگاه های مختلف اطراف خود را به صورت آنلاین خرید کرده و در کمترین زمان ممکن سفارش خود را در محل مورد نظر تحویل بگیرید. در این روش خرید مشتریان بدون صرف هزینه زمانی و جابه جایی به تمامی اجناس فروشگاه های اطراف خود دسترسی داشته و خرید خود را در آرامش انجام داده و با کیفیت درب واحد خود تحویل می گیرند',
    access:'دسترسی ها',
    conectUs:'تماس با ما',
    aboutUs:'درباره ما',
    rouls:'قوانین و مقررات',
    faq:'سوالات متداول',
    jobOffer:'فرصت‌های شغلی',
    suportPhone:'تلفن پشتیبانی',
    guidShop:'راهنمای خرید و پرداخت',
    refundProcess:'رویه بازگرداندن کالا',
    private:'حریم خصوصی',
    customerGuid:'راهنمای مشتریان',
    law:'تمامی حقوق این سایت متعلق به سبک زندگی خلاق (زیرمجموعه هلدینگ میهن) می باشد',
    beWithUs:'همراه همیشگی ما شوید:'

  }



  
}
